# Taps
tap 'hashicorp/tap'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'hashicorp/tap/terraform'
brew 'jq' # Used for spatie/visit
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts
brew 'nvm'
brew 'saml2aws'

# Apps
cask 'discord'
cask 'docker'
cask 'figma'
cask 'google-chrome'
cask 'kap'
cas 'microsoft-onenote'
cask 'pastebot'
cask 'rectangle'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
mas 'Focus To-Do', id: 1258530160
mas 'OneNote', id: 784801555

# chrome extensions bookmarks
